emacs-config.org
#+TITLE: Emacs Configuration
#+STARTUP: overview
#+PROPERTY: header-args:elisp :tangle ./init.el

* 包管理器
** package
   #+begin_src elisp
     (require 'package)
   #+end_src
   
** 配置源
*** CANCEL 清华源
     #+begin_src elisp :tangle no
       (setq package-archives
	     '(("mepla" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
	       ("org" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/org/")
	       ("elpa" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")))
     #+end_src
   
*** 官方源
     #+begin_src elisp
       (setq package-archives
	     '(("melpa" . "https://melpa.org/packages/")
	       ("org" . "https://orgmode.org/elpa/")
	       ("gnu" . "https://elpa.gnu.org/packages/")))
     #+end_src
    
*** 刷新包
     #+begin_src elisp
       (unless package-archive-contents
	 (package-refresh-contents))
     #+end_src

** 导入 custom.el
   #+begin_src elisp
     (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
     (load custom-file)
   #+end_src

** 自动导出 init.el
   #+begin_src elisp
     (defun gq/org-babel-tangle-config ()
       (when (string-equal (buffer-file-name)
			   (expand-file-name "~/.emacs.d/emacs-config.org"))
	 ;; Dynamic scoping to the rescue
	 (let ((org-confirm-babel-evaluate nil))
	   (org-babel-tangle))))

     (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook 'gq/org-babel-tangle-config)))
   #+end_src
   
** use-package
   #+begin_src elisp
     (package-initialize)
     (unless (package-installed-p 'use-package)
       (package-install 'use-package))
     (require 'use-package)
     (setq use-package-always-ensure t)
   #+end_src
   
** quelpa
   #+begin_src elisp :tangle no
     (unless (package-installed-p 'quelpa)
       (with-temp-buffer
	 (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
	 (eval-buffer)
	 (quelpa-self-upgrade)))
   #+end_src
   
* 启动性能
** 检测
   #+begin_src elisp
     (defun efs/display-startup-time ()
       (message "Emacs loaded in %s with %d garbage collections."
		(format "%.2f seconds"
			(float-time
			(time-subtract after-init-time before-init-time)))
		gcs-done))

     (add-hook 'emacs-startup-hook 'efs/display-startup-time)
   #+end_src

** no-littering
   #+begin_src elisp
     (use-package no-littering)
   #+end_src

* 简化界面
** 删除启动消息
   #+begin_src elisp
    (setq inhibit-startup-message t)
   #+end_src
   
** 不显示滚动条
   #+begin_src elisp
    (scroll-bar-mode -1)
   #+end_src

** 不显示工具条
   #+begin_src elisp
    (tool-bar-mode -1)
   #+end_src

** 设置白边
   #+begin_src elisp
   (set-fringe-mode 10)
   #+end_src

** 全屏显示
   #+begin_src elisp
     (toggle-frame-maximized)
   #+end_src

** 设置透明度
   #+begin_src elisp
     (set-frame-parameter (selected-frame) 'alpha '(90 . 50))
   #+end_src

** CANCEL 不显示菜单栏
   #+begin_src elisp :tangle no
     (menu-bar-mode -1)
   #+end_src

** CANCEL 设置可视警告
   #+begin_src elisp :tangle no
     (setq visible-bell t)
   #+end_src

* 简单设置
** 不需要备份文件
  #+begin_src elisp
     (setq make-backup-files nil)
  #+end_src

** 全局快捷键
*** general
    #+begin_src elisp
      (use-package general
	:config
	(general-define-key
	 "M-x" 'counsel-M-x
	 "C-s" 'counsel-grep-or-swiper)

	;; * Mode Keybindings
	;; `general-define-key' is comparable to `define-key' when :keymaps is specified
	(general-define-key
	 ;; NOTE: keymaps specified with :keymaps must be quoted
	 :keymaps 'org-mode-map
	 "<home>" 'beginning-of-line
	 "<end>" 'end-of-line
	 "<escape>" 'keyboard-escape-quit
	 "C-M-j" 'counsel-switch-buffer
	 "C-x b" 'counsel-switch-buffer
	 )
	;; `general-def' can be used instead for `define-key'-like syntax
	(general-def org-mode-map
		     "C-c C-q" 'counsel-org-tag
		     )

	;; * Prefix Keybindings
	;; :prefix can be used to prevent redundant specification of prefix keys
	(general-define-key
	 :prefix "C-c"
	 ;; bind "C-c a" to 'org-agenda
	 "a" 'org-agenda
	 "b" 'counsel-bookmark
	 "c" 'org-capture)
	)
    #+end_src

**** 参考代码
     #+begin_src elisp :tangle no
       ;; for frequently used prefix keys, the user can create a custom definer with a
       ;; default :prefix
       ;; using a variable is not necessary, but it may be useful if you want to
       ;; experiment with different prefix keys and aren't using `general-create-definer'
       (defconst my-leader "C-c")

       (general-create-definer my-leader-def
				 ;; :prefix my-leader
				 ;; or without a variable
				 :prefix "C-c")

       ;; ** Global Keybindings
       (my-leader-def
	"a" 'org-agenda
	"b" 'counsel-bookmark
	"c" 'org-capture)

       ;; ** Mode Keybindings
       (my-leader-def
	:keymaps 'clojure-mode-map
	;; bind "C-c C-l"
	"C-l" 'cider-load-file
	"C-z" 'cider-switch-to-repl-buffer)
       `general-create-definer' creates wrappers around `general-def', so
       ;; `define-key'-like syntax is also supported
       (my-leader-def clojure-mode-map
			"C-l" 'cider-load-file
			"C-z" 'cider-switch-to-repl-buffer)

       ;; * Settings
       ;; change `auto-revert-interval' after autorevert has been loaded (`setq' will
       ;; not work)
       (general-setq auto-revert-interval 10)
     #+end_src

** 系统编码
   #+begin_src elisp
     (setenv "LANG" "en_US.UTF-8")
     (setenv "LC_ALL" "en_US.UTF-8")
     (setenv "LC_CTYPE" "en_US.UTF-8")
   #+end_src

** 环境变量
*** exec-path-from-shell
    #+begin_src elisp
      (use-package exec-path-from-shell
	:config
	(when (memq window-system '(mac ns x))
	  (exec-path-from-shell-initialize)))
    #+end_src

** CANCEL 系统代理
   #+begin_src elisp :tangle no
     (setq url-proxy-services '(("http" . "127.0.0.1:7890")
				("https" . "127.0.0.1:7890")))
   #+end_src

* 外观设置
** 主题
*** doom-themes
    #+begin_src elisp
      (use-package doom-themes
        :config
        ;; Global settings (defaults)
        (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
              doom-themes-enable-italic t) ; if nil, italics is universally disabled
        (load-theme 'doom-solarized-light t)

        ;; Enable flashing mode-line on errors
        (doom-themes-visual-bell-config)

        ;; Enable custom neotree theme (all-the-icons must be installed!)
        (doom-themes-neotree-config)
        ;; or for treemacs users
        (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
        (doom-themes-treemacs-config)

        ;; Corrects (and improves) org-mode's native fontification.
        (doom-themes-org-config))
    #+end_src

*** kaolin-themes
    #+begin_src elisp
     (use-package kaolin-themes
       :config
       ;;  (load-theme 'kaolin-dark t)
       ;;  (kaolin-treemacs-theme)
       )
    #+end_src

*** base16-themes
    #+begin_src elisp
     (use-package base16-theme
       :config
       ;;  (load-theme 'base16-default-dark t)
       )
    #+end_src

*** modus-themes
    #+begin_src elisp
      (use-package modus-themes
	:ensure
	:init
	;; Add all your customizations prior to loading the themes
	(setq modus-themes-slanted-constructs t
	      modus-themes-bold-constructs nil)

	;; Load the theme files before enabling a theme
	(modus-themes-load-themes)
	)
    #+end_src

*** sublime-themes
    #+begin_src elisp
      (use-package sublime-themes)
    #+end_src

** 打开行号
   #+begin_src elisp
     (column-number-mode)
     (global-display-line-numbers-mode t)
     (dolist
	 (mode '(org-mode-hook
		 term-mode-hook
		 eshell-mode-hook
		 treemacs-mode-hook
		 org-agenda-mode-hook
		 ))
       (add-hook mode
		 (lambda () (display-line-numbers-mode 0))
		 )
       )
   #+end_src

** all-the-icons
   #+begin_src elisp 
     (use-package all-the-icons
       :after cnfonts
       :if (display-graphic-p)
       :hook (dired-mode . all-the-icons-dired-mode)
       )
   #+end_src

*** all-the-icons-ivy
    #+begin_src elisp
      (use-package all-the-icons-ivy
	:init (add-hook 'after-init-hook 'all-the-icons-ivy-setup)
	:after (all-the-icons ivy)
	)
    #+end_src

*** all-the-icons-ivy-rich
    #+begin_src elisp
      (use-package all-the-icons-ivy-rich
	:init (all-the-icons-ivy-rich-mode 1)
  	:after (all-the-icons ivy-rich)
	)
    #+end_src

*** all-the-icons-ibuffer
    #+begin_src elisp
      (use-package all-the-icons-ibuffer
	 :init (all-the-icons-ibuffer-mode 1)
	 :after (all-the-icons ibuffer)
	 )
    #+end_src

*** all-the-icons-dired
    #+begin_src elisp
      (use-package all-the-icons-dired
	:after (all-the-icons)
	:if (display-graphic-p)
	:hook (dired-mode . all-the-icons-dired-mode)
	)
    #+end_src

