init.el
(require 'package)

(setq package-archives
  '(("melpa" . "https://melpa.org/packages/")
    ("org" . "https://orgmode.org/elpa/")
    ("gnu" . "https://elpa.gnu.org/packages/")))

(unless package-archive-contents
  (package-refresh-contents))

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)

(defun gq/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
		      (expand-file-name "~/.emacs.d/emacs-config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook 'gq/org-babel-tangle-config)))

(package-initialize)
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)

;; (unless (package-installed-p 'quelpa)
;;   (with-temp-buffer
;;     (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
;;     (eval-buffer)
;;     (quelpa-self-upgrade)))

(defun efs/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
	   (format "%.2f seconds"
		   (float-time
		   (time-subtract after-init-time before-init-time)))
	   gcs-done))

(add-hook 'emacs-startup-hook 'efs/display-startup-time)

(use-package no-littering)

(setq inhibit-startup-message t)

(scroll-bar-mode -1)

(tool-bar-mode -1)

;; (menu-bar-mode -1)

(set-fringe-mode 10)

(toggle-frame-maximized)

(set-frame-parameter (selected-frame) 'alpha '(90 . 50))

;; (setq visible-bell t)

(setq make-backup-files nil)

(use-package general
  :config
  (general-define-key
   "M-x" 'counsel-M-x
   "C-s" 'counsel-grep-or-swiper)

  ;; * Mode Keybindings
  ;; `general-define-key' is comparable to `define-key' when :keymaps is specified
  (general-define-key
   ;; NOTE: keymaps specified with :keymaps must be quoted
   :keymaps 'org-mode-map
   "<home>" 'beginning-of-line
   "<end>" 'end-of-line
   "<escape>" 'keyboard-escape-quit
   "C-M-j" 'counsel-switch-buffer
   )
  ;; `general-def' can be used instead for `define-key'-like syntax
  (general-def org-mode-map
               "C-c C-q" 'counsel-org-tag
               )

  ;; * Prefix Keybindings
  ;; :prefix can be used to prevent redundant specification of prefix keys
  (general-define-key
   :prefix "C-c"
   ;; bind "C-c a" to 'org-agenda
   "a" 'org-agenda
   "b" 'counsel-bookmark
   "c" 'org-capture)
  )

(setenv "LANG" "en_US.UTF-8")
(setenv "LC_ALL" "en_US.UTF-8")
(setenv "LC_CTYPE" "en_US.UTF-8")

;; (setq url-proxy-services '(("http" . "127.0.0.1:7890")
;; 			   ("https" . "127.0.0.1:7890")))

(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-gruvbox-light t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package kaolin-themes
  :config
  ;;  (load-theme 'kaolin-dark t)
  ;;  (kaolin-treemacs-theme)
  )

(use-package base16-theme
  :config
  ;;  (load-theme 'base16-default-dark t)
  )

(use-package modus-themes
  :ensure
  :init
  ;; Add all your customizations prior to loading the themes
  (setq modus-themes-slanted-constructs t
        modus-themes-bold-constructs nil)

  ;; Load the theme files before enabling a theme
  (modus-themes-load-themes)
  :config
  ;; Load the theme of your choice:
  :bind ("<f5>" . modus-themes-toggle))

(use-package sublime-themes)

(column-number-mode)
(global-display-line-numbers-mode t)
(dolist
    (mode '(org-mode-hook
	    term-mode-hook
	    eshell-mode-hook
	    treemacs-mode-hook
	    org-agenda-mode-hook
	    ))
  (add-hook mode
	    (lambda () (display-line-numbers-mode 0))
	    )
  )

(use-package all-the-icons
  :after cnfonts
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode)
  )

(use-package all-the-icons-ivy
  :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup)
  :after (all-the-icons ivy)
  )

(use-package all-the-icons-ivy-rich
  :init (all-the-icons-ivy-rich-mode 1)
  :after (all-the-icons ivy-rich)
  )

(use-package all-the-icons-ibuffer
   :init (all-the-icons-ibuffer-mode 1)
   :after (all-the-icons ibuffer)
   )

(use-package all-the-icons-dired
  :after (all-the-icons)
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode)
  )
