emacs-config.org
** doom-modeline
   #+begin_src elisp
     (use-package doom-modeline
       :init
       (doom-modeline-mode 1)
       :config
       (setq doom-modeline-height 25)
       (setq doom-modeline-bar-width 3)
       (setq doom-modeline-window-width-limit fill-column)
       (setq doom-modeline-project-detection 'project)
       (setq doom-modeline-buffer-file-name-style 'auto)
       (setq doom-modeline-icon (display-graphic-p))
       (setq doom-modeline-major-mode-icon t)
       (setq doom-modeline-major-mode-color-icon t)
       (setq doom-modeline-buffer-state-icon t)
       (setq doom-modeline-buffer-modification-icon t)
       (setq doom-modeline-unicode-fallback t)
       (setq doom-modeline-minor-modes nil)
       (setq doom-modeline-enable-word-count t)
       (setq doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode))
       (setq doom-modeline-buffer-encoding t)
       (setq doom-modeline-indent-info nil)
       (setq doom-modeline-checker-simple-format t)
       (setq doom-modeline-number-limit 99)
       (setq doom-modeline-vcs-max-length 12)
       (setq doom-modeline-workspace-name t)
       (setq doom-modeline-persp-name t)
       (setq doom-modeline-display-default-persp-name nil)
       (setq doom-modeline-persp-icon t)
       (setq doom-modeline-lsp t)
       (setq doom-modeline-github t)
       (setq doom-modeline-github-interval (* 30 60))
       (setq doom-modeline-modal-icon t)
       (setq doom-modeline-mu4e t)
       (setq doom-modeline-gnus t)
       (setq doom-modeline-gnus-timer 2)
       (setq doom-modeline-gnus-excluded-groups '("dummy.group"))
       (setq doom-modeline-irc t)
       (setq doom-modeline-irc-stylize 'identity)
       (setq doom-modeline-env-version t)
       (setq doom-modeline-env-enable-python t)
       (setq doom-modeline-env-enable-ruby t)
       (setq doom-modeline-env-enable-perl t)
       (setq doom-modeline-env-enable-go t)
       (setq doom-modeline-env-enable-elixir t)
       (setq doom-modeline-env-enable-rust t)
       (setq doom-modeline-env-python-executable "python") ; or `python-shell-interpreter'
       (setq doom-modeline-env-ruby-executable "ruby")
       (setq doom-modeline-env-perl-executable "perl")
       (setq doom-modeline-env-go-executable "go")
       (setq doom-modeline-env-elixir-executable "iex")
       (setq doom-modeline-env-rust-executable "rustc")
       (setq doom-modeline-env-load-string "...")
       (setq doom-modeline-before-update-env-hook nil)
       (setq doom-modeline-after-update-env-hook nil)  
       )
   #+end_src

** rainbow-delimiters
   #+begin_src elisp
     (use-package rainbow-delimiters
       :hook (prog-mode . rainbow-delimiters-mode))
   #+end_src

** dashboard
   #+begin_src elisp
     (use-package dashboard
       :config
       (dashboard-setup-startup-hook)
       (setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
       (setq dashboard-banner-logo-title "笔耕不辍, 静水流深        ")
       (setq dashboard-startup-banner "~/.emacs.d/g.png")
       (setq dashboard-center-content t)
       (setq dashboard-set-footer nil)
       (setq dashboard-items '((recents  . 5)
			       (bookmarks . 5)
			       (projects . 5)
			       (agenda . 5)
			       (registers . 5)))
       (setq dashboard-set-heading-icons t)
       (setq dashboard-set-file-icons t)
       (setq dashboard-set-navigator t)
       (setq dashboard-set-init-info t)
       )
   #+end_src

** cnfonts
   #+begin_src elisp
     (use-package cnfonts
       :init
       (cnfonts-enable)
       (cnfonts-set-spacemacs-fallback-fonts)
       (setq cnfonts-profiles
	     '("program" "org-mode" "read-book"))
       (setq cnfonts-personal-fontnames '(("Iosevka Comfy")
					  ()
					  ()))
       (setq use-default-font-for-symbols nil)
       :bind
       (("C-=" . cnfonts-increase-fontsize)
	("C--" . cnfonts-decrease-fontsize)
	)
       )
   #+end_src
   
** highlight-indent-guides
   #+begin_src elisp
     (use-package highlight-indent-guides
       :config (add-hook 'prog-mode-hook 'highlight-indent-guides-mode))
   #+end_src
  
** treemacs
   #+begin_src elisp
     (use-package treemacs
       :defer t
       :init (with-eval-after-load 'winum
	       (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
       :config
       (progn
	 (setq treemacs-collapse-dirs                 (if treemacs-python-executable 3 0)
	       treemacs-deferred-git-apply-delay      0.5
	       treemacs-directory-name-transformer    #'identity
	       treemacs-display-in-side-window        t
	       treemacs-eldoc-display                 t
	       treemacs-file-event-delay              5000
	       treemacs-file-extension-regex          treemacs-last-period-regex-value
	       treemacs-file-follow-delay             0.2
	       treemacs-file-name-transformer         #'identity
	       treemacs-follow-after-init             t
	       treemacs-git-command-pipe              ""
	       treemacs-goto-tag-strategy             'refetch-index
	       treemacs-indentation                   2
	       treemacs-indentation-string            " "
	       treemacs-is-never-other-window         nil
	       treemacs-max-git-entries               5000
	       treemacs-missing-project-action        'ask
	       treemacs-move-forward-on-expand        nil
	       treemacs-no-png-images                 nil
	       treemacs-no-delete-other-windows       t
	       treemacs-project-follow-cleanup        nil
	       treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
	       treemacs-position                      'left
	       treemacs-read-string-input             'from-child-frame
	       treemacs-recenter-distance             0.1
	       treemacs-recenter-after-file-follow    nil
	       treemacs-recenter-after-tag-follow     nil
	       treemacs-recenter-after-project-jump   'always
	       treemacs-recenter-after-project-expand 'on-distance
	       treemacs-show-cursor                   nil
	       treemacs-show-hidden-files             nil
	       treemacs-silent-filewatch              nil
	       treemacs-silent-refresh                nil
	       treemacs-sorting                       'alphabetic-asc
	       treemacs-space-between-root-nodes      t
	       treemacs-tag-follow-cleanup            t
	       treemacs-tag-follow-delay              1.5
	       treemacs-user-mode-line-format         nil
	       treemacs-user-header-line-format       nil
	       treemacs-width                         35
	       treemacs-workspace-switch-cleanup      nil)
	 (treemacs-resize-icons 18)
	 (treemacs-follow-mode t)
	 (treemacs-filewatch-mode t)
	 (treemacs-fringe-indicator-mode t)
	 (pcase (cons (not (null (executable-find "git")))
		      (not (null treemacs-python-executable)))
	   (`(t . t)
	    (treemacs-git-mode 'deferred))
	   (`(t . _)
	    (treemacs-git-mode 'simple))))
       :bind
       (:map global-map
	     ("M-0"       . treemacs-select-window)
	     ("C-x t 1"   . treemacs-delete-other-windows)
	     ("C-x t t"   . treemacs)
	     ("C-x t B"   . treemacs-bookmark)
	     ("C-x t C-t" . treemacs-find-file)
	     ("C-x t M-t" . treemacs-find-tag)))
   #+end_src

** treemacs-projectile
   #+begin_src elisp
     (use-package treemacs-projectile
       :after treemacs projectile)
   #+end_src

** treemacs-magit
   #+begin_src elisp
     (use-package treemacs-magit
       :after treemacs magit)
   #+end_src

