emacs-config.org
** centaur-tabs
   #+begin_src elisp
     (use-package centaur-tabs
       :load-path "~/.emacs.d/other/centaur-tabs"
       :config
       (setq centaur-tabs-style "wave"
	     centaur-tabs-height 40
	     centaur-tabs-set-icons t
	     centaur-tabs-set-modified-marker t
	     centaur-tabs-show-navigation-buttons t
	     centaur-tabs-set-bar 'under
	     x-underline-at-descent-line t)
       (centaur-tabs-headline-match)

       (setq centaur-tabs-gray-out-icons 'buffer)
       (centaur-tabs-enable-buffer-reordering)
       (setq centaur-tabs-adjust-buffer-order t)
       (centaur-tabs-mode t)
       (setq uniquify-separator "/")
       (setq uniquify-buffer-name-style 'forward)
       :hook
       (dashboard-mode . centaur-tabs-local-mode)
       (term-mode . centaur-tabs-local-mode)
       (calendar-mode . centaur-tabs-local-mode)
       (org-agenda-mode . centaur-tabs-local-mode)
       (helpful-mode . centaur-tabs-local-mode)
       :bind
       ("C-<prior>" . centaur-tabs-backward)
       ("C-<next>" . centaur-tabs-forward)
       ("C-c t s" . centaur-tabs-counsel-switch-group)
       ("C-c t p" . centaur-tabs-group-by-projectile-project)
       ("C-c t g" . centaur-tabs-group-buffer-groups)
       )
   #+end_src

** ibuffer-vc
   #+begin_src elisp
     (global-set-key (kbd "C-x C-b") 'ibuffer)
     (use-package ibuffer-vc)
   #+end_src

** dired
   #+begin_src elisp
     (setq dired-guess-shell-alist-user '(("\\.pdf\\'" "open")
					  ("\\.doc\\'" "open")
					  ("\\.docx\\'" "open")
					  ("\\.ppt\\'" "open")
					  ("\\.pptx\\'" "open")
					  ("\\.xls\\'" "open")))
     (add-hook 'dired-load-hook
	       (lambda ()
		 (setq dired-x-hands-off-my-keys nil)
		 (load "dired-x")
		 ;; Set dired-x global variables here.  For example:
		 ;; (setq dired-guess-shell-gnutar "gtar")
		 ))
     (add-hook 'dired-mode-hook
	       (lambda ()
		 ;; Set dired-x buffer-local variables here.  For example:
		 ;; (dired-omit-mode 1)
		 ))
   #+end_src

** dired-single
   #+begin_src elisp
       (use-package dired-single
	 :config
	 (defun my-dired-init ()
	   "Bunch of stuff to run for dired, either immediately or when it's
     loaded."
	   ;; <add other stuff here>
	   (define-key dired-mode-map [remap dired-find-file]
	     'dired-single-buffer)
	   (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
	     'dired-single-buffer-mouse)
	   (define-key dired-mode-map [remap dired-up-directory]
	     'dired-single-up-directory))

	 ;; if dired's already loaded, then the keymap will be bound
	 (if (boundp 'dired-mode-map)
	     ;; we're good to go; just add our bindings
	     (my-dired-init)
	   ;; it's not loaded yet, so add our bindings to the load-hook
	   (add-hook 'dired-load-hook 'my-dired-init))
	 )
   #+end_src
   
** dired-hide-dotfiles
   #+begin_src elisp
     (use-package dired-hide-dotfiles
       :config
       (defun my-dired-mode-hook ()
	 "My `dired' mode hook."
	 ;; To hide dot-files by default
	 (dired-hide-dotfiles-mode))

       ;; To toggle hiding
       (define-key dired-mode-map "." #'dired-hide-dotfiles-mode)
       (add-hook 'dired-mode-hook #'my-dired-mode-hook)
       )
   #+end_src

** ranger
   #+begin_src elisp
     (use-package ranger)
   #+end_src

** visual-fill-column
   #+begin_src elisp
     (defun gq/org-mode-visual-fill ()
       (setq visual-fill-column-width 120
	     visual-fill-column-center-text t)
       (visual-fill-column-mode 1))

     (use-package visual-fill-column
       :defer t
       :hook (org-mode . gq/org-mode-visual-fill))
   #+end_src

* 自动补全
** smex
   Smart M-x
   #+begin_src elisp
     ;; (use-package smex)
   #+end_src

** ivy
   #+begin_src elisp
     (use-package ivy
       :diminish
       :bind
       (("C-s" . swiper)
	:map ivy-minibuffer-map
	("TAB" . ivy-alt-done)
	("C-l" . ivy-alt-done)
	("C-j" . ivy-next-line)
	("C-k" . ivy-previous-line)
	:map ivy-switch-buffer-map
	("C-k" . ivy-previous-line)
	("C-l" . ivy-done)
	:map ivy-reverse-i-search-map
	("C-k" . ivy-previous-line)
	("C-d" . ivy-reverse-i-search-kill)
	)
       :config
       (ivy-mode 1))
   #+end_src

** ivy-rich
   #+begin_src elisp
     (use-package ivy-rich
       :after (counsel ivy)
       :init (ivy-rich-mode 1)
       )
   #+end_src

** ivy-bibtex
   #+begin_src elisp
     (use-package ivy-bibtex
       :init
       (setq ivy-re-builders-alist
	     '((ivy-bibtex . ivy--regex-ignore-order)
	       (t . ivy--regex-plus)))
       (setq bibtex-completion-bibliography
	     '("~/SynologyDrive/Library/bib/mybib.bib"))
       (setq bibtex-completion-library-path
	     '("~/SynologyDrive/Library/pdf"))
       (setq bibtex-completion-pdf-field "File")
       (setq bibtex-completion-notes-path "~/SynologyDrive/Library/notes")
       (setq bibtex-completion-display-formats
	 '((article       . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${journal:40}")
	   (inbook        . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
	   (incollection  . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	   (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
	   (t             . "${=has-pdf=:1}${=has-note=:1} ${=type=:3} ${year:4} ${author:36} ${title:*}")))
       (setq bibtex-completion-pdf-symbol "⌘")
       (setq bibtex-completion-notes-symbol "✎")
       (setq bibtex-completion-pdf-extension '(".pdf" ".djvu"))
       (setq bibtex-completion-format-citation-functions
	     '((org-mode      . bibtex-completion-format-citation-org-link-to-PDF)
	       (latex-mode    . bibtex-completion-format-citation-cite)
	       (markdown-mode . bibtex-completion-format-citation-pandoc-citeproc)
	       (default       . bibtex-completion-format-citation-default)))  
       (defun ivy-bibtex-my-publications (&optional arg)
	 "Search BibTeX entries authored by “Jane Doe”.

     With a prefix ARG, the cache is invalidated and the bibliography reread."
	 (interactive "P")
	 (when arg
	   (bibtex-completion-clear-cache))
	 (bibtex-completion-init)
	 (ivy-read "BibTeX Items: "
		   (bibtex-completion-candidates)
		   :initial-input "Jane Doe"
		   :caller 'ivy-bibtex
		   :action ivy-bibtex-default-action))

       ;; Bind this search function to Ctrl-x p:
       :bind (("C-x p" . ivy-bibtex-my-publications))
       )
   #+end_src

** ivy-posframe
   #+begin_src 
     (use-package ivy-posframe
       :init
       (setq ivy-posframe-display-functions-alist
	   '((swiper          . ivy-display-function-fallback)
	     (complete-symbol . ivy-posframe-display-at-point)
	     (counsel-M-x     . ivy-posframe-display-at-window-bottom-left)
	     (t               . ivy-posframe-display)))
       (ivy-posframe-mode 1)
       )
   #+end_src

** counsel
   #+begin_src elisp
     (use-package counsel
       :bind
       (("M-x" . counsel-M-x)
	("C-x b" . counsel-ibuffer)
	("C-x C-f" . counsel-find-file)
	:map minibuffer-local-map
	("C-r" . 'counsel-minibuffer-history))
       ;; Don't start with ^
       :config
       (setq ivy-initial-inputs-alist nil)
       :init
       (setq counsel-find-file-ignore-regexp
	     (concat "\\(?:\\`[#.]\\)" "\\|\\(?:\\`.+?[#~]\\'\\)")))
   #+end_src
   
** which-key
   #+begin_src elisp
     (use-package which-key
       :init (which-key-mode)
       :diminish
       :config (setq which-key-idle-delay 0))
   #+end_src

** helpful
   #+begin_src elisp
     (use-package helpful
       :custom
       (counsel-describe-function-function #'helpful-callable)
       (counsel-describe-variable-function #'helpful-variable)
       :bind
       ([remap describe-function] . counsel-describe-function)
       ([remap describe-command] . helpful-command)
       ([remap describe-variable] . counsel-describe-variable)
       ([remap describe-key] . helpful-key))
   #+end_src

* 编程
** 项目管理
*** projectile
    #+begin_src elisp
      (use-package projectile
	:diminish projectile
	:config
	(projectile-mode)
	:bind-keymap
	("C-c p" . projectile-command-map)
	:init
	(when (file-directory-p "~/projects")
	  (setq projectile-project-search-path '("~/projects")))
	(setq projectile-switch-project-action #'projectile-dired)
	)
    #+end_src

*** counsel-projectile
    #+begin_src elisp
      (use-package counsel-projectile
	:config
	(counsel-projectile-mode))
    #+end_src

** 补全
*** lsp-mode
    #+begin_src elisp
      (defun gq/setup-lsp-mode ()
	(setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
	(lsp-headerline-breadcrumb-mode)
	(lsp-enable-which-key-integration)
	)
      (use-package lsp-mode
	:commands
	(lsp lsp-deferred)
	:hook
	((python-mode . lsp)
	 (lsp-mode . gq/setup-lsp-mode))
	:init (setq lsp-keymap-prefix "C-c l"))
    #+end_src

*** lsp-ivy
    #+begin_src elisp
      (use-package lsp-ivy
	:commands lsp-ivy-workspace-symbol)
    #+end_src
    
