init.el

(use-package lsp-ui
  :custom
  (lsp-ui-imenu-enable t)

  (lsp-ui-sideline-ignore-duplicate t)
  (lsp-ui-sideline-show-symbol t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-sideline-show-diagnostics nil)
  (lsp-ui-sideline-show-code-actions t)
  (lsp-ui-sideline-code-actions-prefix "")

  (lsp-ui-peek-enable t)
  (lsp-ui-peek-peek-height 20)
  (lsp-ui-peek-list-width 50)
  (lsp-ui-peek-fontify 'on-demand)

  (lsp-ui-doc-enable nil)
  (lsp-ui-doc-position 'at-point)
  (lsp-ui-doc-max-width 400)
  (lsp-ui-doc-max-height 20)
  (lsp-ui-doc-use-webkit t)
  :preface
  (defun ladicle/toggle-lsp-ui-doc ()
    (interactive)
    (if lsp-ui-doc-mode
	(progn
	  (lsp-ui-doc-mode -1)
	  (lsp-ui-doc--hide-frame))
      (lsp-ui-doc-mode 1)))
  :bind
  (:map lsp-mode-map
	("C-c C-r" . lsp-ui-peek-find-references)
	("C-c C-j" . lsp-ui-peek-find-definitions)
	("C-c i" . lsp-ui-peek-find-definitions)
	("C-c m" . lsp-ui-imenu)
	("C-c s" . lsp-ui-sideline-mode)
	("C-c d"   . ladicle/toggle-lsp-ui-doc))
  :hook
  (lsp-mode . lsp-ui-mode))

(use-package company)
(add-hook 'after-init-hook 'global-company-mode)

(use-package company-lsp
  :config
  (push 'company-lsp company-backends))

(use-package yasnippet
  :init
  (yas-global-mode 1))

(use-package yasnippet-snippets)

(use-package dap-mode
  :bind
  (("<f7>" . dap-step-in)
   ("<M-f7>" . dap-step-out)
   ("<f8>" . dap-next)
   ("<f9>" . dap-continue)
   ("<f5>" . dap-debug))
  :hook
  ((python-mode . dap-mode)
   (python-mode . dap-ui-mode))
  :config
  (require 'dap-python)  
  (setq dap-auto-configure-features '(sessions breakpoints locals controls tooltip repl))
  (dap-ui-mode 1)
  (dap-tooltip-mode 1)
  (tooltip-mode 1)
  (dap-ui-controls-mode 1))

(use-package magit
  :commands
  (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :bind
  ("C-x g" . magit-status)
  )

(setq org-support-shift-select 1)

(defun insert-zero-width-space () (interactive) (insert-char #x200b))
(defun my-latex-filter-zws (text backend info)
  (when (org-export-derived-backend-p backend 'latex)
    (replace-regexp-in-string "\x200B" "{}" text)))
(global-set-key (kbd "C-*") 'insert-zero-width-space)

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("el" . "src elisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))

(defface org-checkbox-done-text
  '((t (:foreground "#71696A" :strike-through t)))
  "Face for the text part of a checked org-mode checkbox.")
(font-lock-add-keywords
 'org-mode
 `(("^[ \t]*\\(?:[-+*]\\|[0-9]+[).]\\)[ \t]+\\(\\(?:\\[@\\(?:start:\\)?[0-9]+\\][ \t]*\\)?\\[\\(?:X\\|\\([0-9]+\\)/\\2\\)\\][^\n]*\n\\)"
    1 'org-checkbox-done-text prepend)) 'append)

(add-hook 'org-mode-hook (lambda ()
			   "Beautify Org Checkbox Symbol"
			   (push '("[ ]" . "☐") prettify-symbols-alist)
			   (push '("[X]" . "☑") prettify-symbols-alist)
			   (push '("[-]" . "❍") prettify-symbols-alist)
			   (prettify-symbols-mode)))

(setq org-ellipsis " ↴ ")

(setq org-src-fontify-natively t)

(setq org-hide-emphasis-markers t)

(setq org-file-apps
      '(("\\.pdf\\'" . (lambda (file link) (org-pdftools-open link)))
	(directory . emacs)
	(auto-mode . emacs)
	("\\.mm\\'" . default)
	("\\.x?html?\\'" . default)
	("\\.pptx?\\'" . system)
	("\\.docx?\\'" . system)
	("\\.xlsx?\\'" . system)
	("\\.png?\\'" . system)))

(setq org-todo-keywords
      '((sequence "TODO" "NEXT" "|" "DONE" "CANCEL")))
(setq org-todo-keyword-faces
  '(("TODO" . (:foreground "red" :weight bold))
    ("NEXT" . "#E35DBF")
    ("DONE" . (:foreground "#1AA260" :weight bold))
    ("CANCEL" . (:foreground "#888888")))
  )

(custom-theme-set-faces
 'user
 '(variable-pitch ((t (:family "CMU Typewriter Text"))))
 '(fixed-pitch ((t ( :family "Fira Code" :height 160))))
 '(org-block ((t (:inherit fixed-pitch))))
 '(org-code ((t (:inherit (shadow fixed-pitch)))))
 '(org-document-info ((t (:foreground "dark orange"))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-indent ((t (:inherit (org-hide fixed-pitch)))))
 '(org-link ((t (:foreground "royal blue" :underline t))))
 '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-property-value ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
 '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
 '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)

(setq org-tag-alist
      '((:startgroup)
	(:endgroup)
	("outlook" . ?o)
	("gmail" . ?g)
	)
      )

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))
(setq org-confirm-babel-evaluate nil)

(use-package org-pomodoro
  :commands org-pomodoro
  )

(use-package org-pretty-tags
  :after orgmode
  )

(setq org-capture-templates
      '(
	("n" "Next" entry (file+headline "~/SynologyDrive/org/todo.org" "Inbox")
	 "* TODO %?\n SCHEDULED: %T \n %i\n  %a")
	("t" "Todo" entry (file+headline "~/SynologyDrive/org/todo.org" "Inbox")
	 "* TODO %?\n SCHEDULED: %^T\n")
	("f" "Todo with File" entry (file+headline "~/SynologyDrive/org/todo.org" "Inbox")
	 "* TODO %?\n SCHEDULED: %^T \n %i\n  %a")
	("j" "Journal" entry (file+datetree "~/SynologyDrive/org/journal.org")
	 "* %?\nEntered on %U\n  %i")
	("m" "Email" entry (file+headline "~/SynologyDrive/org/todo.org" "Email")
	 "* TODO %^{待办事项} %^g\n  SCHEDULED: %T DEADLINE: %^T \n  :PROPERTIES:\n  LINK:%i %a\n  :END:\n  %?")
      ))

(use-package org2blog
  :after org
  :config
  (setq org2blog/wp-blog-alist
	'(("myblog"
	   :url "http://galoisgu.com/wordpress/xmlrpc.php"
	   :username "guqun")))
  )

(use-package org-download
  :commands org)

(use-package org-kanban
  :commands org-kanban)

(use-package org-superstar)
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))

(use-package org-roam
  :hook (after-init . org-roam-mode)
  :custom (org-roam-directory "~/SynologyDrive/org/roam/")
  :bind
  (:map org-roam-mode-map
	(("C-c n l" . org-roam)
	 ("C-c n f" . org-roam-find-file)
	 ("C-c n g" . org-roam-graph))
	:map org-mode-map
	(("C-c n i" . org-roam-insert)
	 ("C-c n I" . org-roam-insert-immediate))
	))
