emacs-config.org
**** org-roam-server
     #+begin_src elisp
       (use-package org-roam-server
	 :after org-roam
	 :config
	 (setq org-roam-server-host "127.0.0.1"
	       org-roam-server-port 8080
	       org-roam-server-authenticate nil
	       org-roam-server-export-inline-images t
	       org-roam-server-serve-files nil
	       org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
	       org-roam-server-network-poll t
	       org-roam-server-network-arrows nil
	       org-roam-server-network-label-truncate t
	       org-roam-server-network-label-truncate-length 60
	       org-roam-server-network-label-wrap-length 20))
     #+end_src

**** org-fancy-priorities
     #+begin_src elisp
       (use-package org-fancy-priorities
	 :hook
	 (org-mode . org-fancy-priorities-mode)
	 :config
	 (setq org-fancy-priorities-list
	       '((?A . "❗")(?B . "⬆")(?C . "⬇")(?D . "☕")
		 (?1 . "⚡")(?2 . "⮬")(?3 . "⮮")(?4 . "☕")(?I . "Important"))))
     #+end_src

**** org-pdftools
     #+begin_src elisp
       (use-package org-pdftools
	 :hook (org-mode . org-pdftools-setup-link))
     #+end_src

**** org-noter-pdftools
     #+begin_src elisp
       (use-package org-noter-pdftools
	 :after org-noter
	 :config
	 (with-eval-after-load 'pdf-annot
	   (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
     #+end_src

**** org-super-agenda
     #+begin_src elisp
       (use-package org-super-agenda
	 :config
	 (setq org-super-agenda-groups
	       '((:name "Next Items"
			:time-grid t
			:tag ("NEXT" "outbox"))
		 (:name "Important"
			:priority "A")
		 (:name "Quick Picks"
			:effort< "0:30")
		 (:priority<= "B"
			      :scheduled future
			      :order 1)))
	 )
     #+end_src

**** org-mime
     #+begin_src elisp
       (use-package org-mime
	 :after org
	 )
     #+end_src

**** org-protocol
     #+begin_src elisp
       (require 'org-protocol)
     #+end_src
*** python

**** lsp-python-ms
     #+begin_src elisp
	(use-package lsp-python-ms
	  :init (setq lsp-python-ms-auto-install-server t)
	  :hook (python-mode . (lambda () (require 'lsp-python-ms) (lsp))))
     #+end_src
     
**** pyenv-mode
     #+begin_src elisp
	(use-package pyenv-mode)
     #+end_src
     
**** dap-python
     #+begin_src elisp
	(require 'dap-python)
     #+end_src

*** latex
**** 编译器配置
     #+begin_src elisp
     (add-hook
      'LaTeX-mode-hook
      (lambda ()
	(add-to-list
	 'TeX-command-list
	 '("XeLaTeX" "%`xelatex --synctex=1%(mode)%' %t" TeX-run-TeX nil t))))
     #+end_src

**** auctex
     #+begin_src elisp
     (use-package auctex
       :defer t)
     #+end_src

** 折叠
*** hs-minor-mode
    #+begin_src elisp
     (defun toggle-selective-display (column)
       (interactive "P")
       (set-selective-display
	(or column
	    (unless selective-display
	      (1+ (current-column))))))
     (defun toggle-hiding (column)
       (interactive "P")
       (if hs-minor-mode
	   (if (condition-case nil
		   (hs-toggle-hiding)
		 (error t))
	       (hs-show-all))
	 (toggle-selective-display column)))
     (global-set-key (kbd "C-+") 'toggle-hiding)
     (global-set-key (kbd "C-\\") 'toggle-selective-display)
     (add-hook 'prog-mode-hook #'hs-minor-mode)
    #+end_src
** 注释
*** evil-nerd-commenter
    #+begin_src elisp
      (use-package evil-nerd-commenter
	:bind
	("M-/" . evilnc-comment-or-uncomment-lines)
	)
    #+end_src
* 常用工具
** doc-view
   #+begin_src elisp
     (setq doc-view-resolution 200)
   #+end_src

** calfw
   #+begin_src elisp
     (use-package calfw
       :config
       (require 'calfw-org)
       (setq cfw:org-overwrite-default-keybinding t))
   #+end_src

** powerthesaurus
   #+begin_src elisp
     (use-package powerthesaurus)
   #+end_src

** pdf
*** pdf-tools
    #+begin_src elisp
       (use-package pdf-tools
	 :defer t
	 :commands (pdf-view-mode pdf-tools-install)
	 :mode ("\\.[pP][dD][fF]" . pdf-view-mode)
	 :magic ("%PDF" . pdf-view-mode)
	 :config (pdf-tools-install :no-query)
	 )
    #+end_src

*** pdf-view-restore
    #+begin_src elisp
       (use-package pdf-view-restore
	 :after pdf-tools
	 :config
	 (add-hook 'pdf-view-mode-hook 'pdf-view-restore-mode))
    #+end_src

** email
*** mu4e
    #+begin_src elisp
      (add-to-list 'load-path "/usr/local/Cellar/mu/1.4.14/share/emacs/site-lisp/mu/mu4e")
      (require 'mu4e)
      (setq mu4e-change-filenames-when-moving t)
      (setq mu4e-contexts
	    (list
	     ;; Gmail account
	     (make-mu4e-context
	      :name "gmail"
	      :vars '((mu4e-maildir . "~/.mail/gmail/")
		      (user-mail-address . "davidguqun@gmail.com")
		      (user-full-name    . "Qun Gu")
		      (mu4e-drafts-folder  . "/gmail/[Gmail]/Drafts")
		      (mu4e-sent-folder  . "/gmail/[Gmail]/Sent Mail")
		      (mu4e-refile-folder  . "/gmail/[Gmail]/All Mail")
		      (mu4e-trash-folder  . "/gmail/[Gmail]/Trash")
		      (mu4e-maildir-shortcuts . 
					      ((:maildir "/gmail/Inbox" :key ?i)
					       (:maildir "/gmail/[Gmail]/Sent Mail" :key ?s)
					       (:maildir "/gmail/[Gmail]/Trash" :key ?d)
					       (:maildir "/gmail/[Gmail]/All Mail" :key ?a)
					       (:maildir "/gmail/[Gmail]/Drafts" :key ?r)
					       (:maildir "/gmail/Edria" :key ?e)
					       )
					      )		
		      )
	      )

	     ;; Outlook account
	     (make-mu4e-context
	      :name "outlook"
	      :vars '((mu4e-maildir . "~/.mail/outlook/")
		      (user-mail-address . "guqun@outlook.com")
		      (user-full-name    . "Qun Gu")
		      (mu4e-drafts-folder  . "/outlook/Drafts")
		      (mu4e-sent-folder  . "/outlook/Sent")
		      (mu4e-refile-folder  . "/outlook/Archive")
		      (mu4e-trash-folder  . "/outlook/Deleted")
		      (mu4e-maildir-shortcuts . 
					      ((:maildir "/outlook/Inbox" :key ?i)
					       (:maildir "/outlook/Sent" :key ?s)
					       (:maildir "/outlook/Deleted" :key ?d)
					       (:maildir "/outlook/Archive" :key ?a)
					       (:maildir "/outlook/Drafts" :key ?r)
					       (:maildir "/outlook/Edria" :key ?e)))
		      )
	      )
	     )
	    )

      (setq mail-user-agent 'mu4e-user-agent)
      (setq mu4e-get-mail-command "mbsync -a")
      (setq mu4e-update-interval 300)             ;; update every 5 minutes
      (setq mu4e-compose-signature
	    (concat
	     "Qun Gu\n"
	     "Sent from Emacs"))
;;      (setq mu4e-use-fancy-chars t)
    #+end_src

*** mu4e-views
    #+begin_src elisp
       (use-package mu4e-views
	 :after mu4e
	 :defer nil
	 :bind (:map mu4e-headers-mode-map
		   ("v" . mu4e-views-mu4e-select-view-msg-method) ;; select viewing method
		   ("M-n" . mu4e-views-cursor-msg-view-window-down) ;; from headers window scroll the email view
		   ("M-p" . mu4e-views-cursor-msg-view-window-up) ;; from headers window scroll the email view
		   ("f" . mu4e-views-toggle-auto-view-selected-message) ;; toggle opening messages automatically when moving in the headers view
		   )
	 :config
	 (setq mu4e-views-completion-method 'ivy) ;; use ivy for completion
	 (setq mu4e-views-default-view-method "html") ;; make xwidgets default
	 (mu4e-views-mu4e-use-view-msg-method "html") ;; select the default
	 (setq mu4e-views-next-previous-message-behaviour 'stick-to-current-window) ;; when pressing n and p stay in the current window
	 (setq mu4e-views-auto-view-selected-message t)) ;; automatically open messages when moving in the headers view
    #+end_src

*** mu4e-alert
    #+begin_src elisp
       (use-package mu4e-alert
	 :after mu4e
	 :init
	 (setq mu4e-alert-interesting-mail-query
	    "flag:unread maildir:/Inbox"
	    )
	 (mu4e-alert-enable-mode-line-display)
	 (defun gjstein-refresh-mu4e-alert-mode-line ()
	   (interactive)
	   (mu4e~proc-kill)
	   (mu4e-alert-enable-mode-line-display)
	   )
	 (run-with-timer 0 60 'gjstein-refresh-mu4e-alert-mode-line)
	 )
    #+end_src

*** mu4e-marker-icons
    #+begin_src elisp
      ;; (use-package mu4e-marker-icons
      ;;   :init (mu4e-marker-icons-mode 1))
    #+end_src

*** mu4e-org
    #+begin_src elisp
      (require 'mu4e-org)
    #+end_src

*** smtpmail
    #+begin_src elisp
       (setq smtpmail-default-smtp-server "smtp.office365.com"
	     smtpmail-smtp-server "smtp.office365.com"
	     smtpmail-smtp-service 587)
    #+end_src
   
    
